story = """
    童年就像一个五彩斑斓的盒子，里面装满了许许多多五彩缤纷的珍珠。有些已经随着岁月的流失而渐渐褪色，有些却依然光彩照人，使我难以忘怀。 
    
    一年前的某一天，妈妈带着我和领居家的小朋友一起去做蛋糕。我们一路说说笑笑，不一会儿就到达了目的地。 
    
    工作人员给我们了两块香喷喷的蛋糕，让我们给蛋糕抹上奶油。我拿着刷板，呆呆地坐在那里，不知道该从哪儿开始刷。妈妈看我那不知所措的样子，立马就
急了。她说：“唉，真笨！看好了，我来给你演示一下。”说完，便飞快地用刷板抹起了奶油。我专心致志地观察妈妈是怎样抹奶油的。 
    
    看了一会儿，我恍然大悟。抹奶油也不过如此嘛！我自告奋勇地让妈妈把刷板递给我，决定自己尝试一下。在妈妈的指导下，我成功地将奶油刷好了。
    
    刷完了奶油，就应该给蛋糕做装饰了。我拿起了挤彩色奶油的工具，准备做一个多口味的彩色蛋糕。我想涂一朵小花，可手就像不听使唤似的，在漫无目的地乱涂。
再看看邻居家的小孩吧，他已经涂上了好几朵小花，都准备放水果了。我只好向妈妈求助。
    
    妈妈看了我的“杰作”后，先是皱了一下眉头，然后叹了一口气，无奈地说：“这我可帮不了你，你自己随便涂涂吧。”听了妈妈的话，我失望极了，只好垂头丧气地乱涂。 
    
    虽然我的蛋糕做得很不理想，但工作人员说，我的蛋糕与众不同。听了这话，我的心情好了一些。 
    
    这件事虽然已经过去了一段时间，但我从中明白了：做什么事都要坚持下去，不能半途而废。只有坚持不懈，并且相信自己，那么最后一定能把事做好。"""